Core/src/src/DataProcessors/AzRy1C_JiraSyncConsole/AzRy1C_JiraSyncConsole.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>AzRy1C_JiraSyncConsole</name>
  <attributes>
    <name>Сервер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СерверWorklogs</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Resource</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>HttpPath</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Authorization</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ShowLogs</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>AccountsWithNoProjects</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>WorklogResource</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДопИнфоКоличествоНовыхAccounts</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДопИнфоКоличествоИзмененыхAccounts</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДопИнфоКоличествоНовыеСотрудники</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДопИнфоКоличествоНовыеЗаданиеНаРаботу</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДопИнфоWorklogsКолИзмененыеДлительностьВЧасах</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗадНаРаботуМесацЗагрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ДопИнфоКоличествоНовыхJiraProjects</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>AccountCategoriesAndAccounts</name>
    <attributes>
      <name>Вибор</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ID</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Key</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Name</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Self</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Type</name>
      <type>
        <types>EnumRef.AzRyTempoObjects</types>
      </type>
    </attributes>
    <attributes>
      <name>CategoryID</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Проекты</name>
      <type>
        <types>CatalogRef.Проекты</types>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>LinksToProjects</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИзмененName</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Status</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИзмененCategoryID</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>JiraUsers</name>
    <attributes>
      <name>ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Name</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Worklogs</name>
    <attributes>
      <name>wr_user_account_id</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>wr_user_name</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>wr_account</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>wr_date</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>wr_hours</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>wr_version</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>wr_last_update_time</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>wr_count</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>wr_issue_id</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>wr_jiraproject_id</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>Проект</name>
      <type>
        <types>CatalogRef.Проекты</types>
      </type>
    </attributes>
    <attributes>
      <name>НовыйСотрудник</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НовыйПроект</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗаданиеНаРаботу</name>
      <type>
        <types>DocumentRef.ЗаданиеНаРаботу</types>
      </type>
    </attributes>
    <attributes>
      <name>ДлительностьВЧасах</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>tempoWorklogId</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>JiraProject</name>
      <type>
        <types>CatalogRef.AzRyJiraProject</types>
      </type>
    </attributes>
    <attributes>
      <name>JiraProjectСоот</name>
      <type>
        <types>AnyRef</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПроектыСПустымиЗаказ</name>
    <attributes>
      <name>Проект</name>
      <type>
        <types>CatalogRef.Проекты</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>JiraProjects</name>
    <attributes>
      <name>Новый</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Измененный</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>id</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>key</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>_description</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>lead</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>leadId</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>active</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>name</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>projectTypeKey</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>AzRyJiraProject</name>
      <type>
        <types>CatalogRef.AzRyJiraProject</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

Core/src/src/DataProcessors/AzRy1C_JiraSyncConsole/Forms/Форма/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ МОДУЛЯ ФОРМЫ


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	Объект.СерверWorklogs = "pas.azrycloud.com";	
	Объ = РеквизитФормыВЗначение("Объект");
	Объ.WorklogResource = Объ.getMaxSelectVersion();
	ЗначениеВРеквизитФормы(Объ, "Объект");
	
КонецПроцедуры

#Область Accounts_and_AccountCategories

&НаКлиенте
Процедура ОбновитьТаблицуCategories(Команда)
	ОбновитьТаблицуCategoriesНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновитьТаблицуCategoriesНаСервере()
	
	Объ = РеквизитФормыВЗначение("Объект");
	
	Ответ = Объ.GetAccountsAndAccountCategories();
	Если Ответ.ОщибкаСоединения Тогда // შეცდომა სერვერთან დაკავშირებისას
		Сообщить("შეცდომა სერვერთან დაკავშირებისას, მიზეზი: " + Ответ.Текст);
		Возврат;
	ИначеЕсли Ответ.ОщибкаКодСостояния Тогда // შეცდომა სერვერიდან დაბრუნებული კოდის პასუხის მიხედვით	
	    Сообщить("შეცდომა სერვერიდან დაბრუნებული კოდის (" + Ответ.HTTPЗапрос.КодСостояния + ") პასუხის მიხედვით, მიზეზი: " + Ответ.Текст);
		Возврат;
	КонецЕсли; 
		
	Объ.ДопИнфоКоличествоНовыхAccounts     = Ответ.ДопИнфо.КоличествоНовых;
	Объ.ДопИнфоКоличествоИзмененыхAccounts = Ответ.ДопИнфо.КоличествоИзмененые;
	
	ЗначениеВРеквизитФормы(Объ, "Объект");
	
КонецПроцедуры 

&НаКлиенте
Процедура СозданиеНовыхПроектов(Команда)
	СозданиеНовыхПроектовНаСервере();
	ОбновитьТаблицуCategoriesНаСервере();
КонецПроцедуры

&НаСервере
Процедура СозданиеНовыхПроектовНаСервере()
	
	Объ = РеквизитФормыВЗначение("Объект");
	Объ.СозданиеНовыхПроектов(); 
	ЗначениеВРеквизитФормы(Объ, "Объект");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновлениеНаименованийПроектов(Команда)
	ОбновлениеПроектовНаСервере();
	ОбновитьТаблицуCategoriesНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновлениеПроектовНаСервере()
	
	Объ = РеквизитФормыВЗначение("Объект");
	Ответ = Объ.ОбновлениеПроектов();
	
	Если Ответ.Ошибка Тогда
		Сообщить(Ответ.Текст);
		Возврат;
	КонецЕсли;
	ЗначениеВРеквизитФормы(Объ, "Объект");
		
КонецПроцедуры

#КонецОбласти

#Область Jira_Users

&НаКлиенте
Процедура СинхронизацияСJiraUsers(Команда)
	СинхронизацияСJiraUsersНаСервере();
КонецПроцедуры

&НаСервере
Процедура СинхронизацияСJiraUsersНаСервере()
	
	Для каждого ТекСтрока Из Объект.JiraUsers Цикл
		Если ЗначениеЗаполнено(ТекСтрока.Сотрудник) Тогда
			Если ТекСтрока.Сотрудник.AzRyJiraUserIDs.Количество() > 0 Тогда
				Сообщить("თანამშრომელს " + ТекСтрока.Сотрудник.Наименование + " უკვე მინიჭებული აქვს გუიდი.");
				Продолжить;
			КонецЕсли; 
			
			О = ТекСтрока.Сотрудник.ПолучитьОбъект();
			НоваяСтрока = О.AzRyJiraUserIDs.Добавить();
			НоваяСтрока.id = СокрЛП(ТекСтрока.ID);
			О.Записать();
			
			ПараметрыОтбора = Новый Структура;
			ПараметрыОтбора.Вставить("wr_user_account_id", ТекСтрока.ID);
			НайденныеСтроки = Объект.Worklogs.НайтиСтроки(ПараметрыОтбора);
			
			Для каждого ТекIssue Из НайденныеСтроки Цикл
				ТекIssue.Сотрудник      = О.Ссылка;
				ТекIssue.НовыйСотрудник = Ложь;
			КонецЦикла;
		КонецЕсли;	
	КонецЦикла;                                
	
	// ცხრილის განახლება
	Объ = РеквизитФормыВЗначение("Объект");
	Объ.ДжираПользователи(Объект.Worklogs.Выгрузить());

	// ცხრილის განახლება
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("НовыйСотрудник", Истина);
	НайденныеСтроки = Объект.Worklogs.НайтиСтроки(ПараметрыОтбора);
	
	Объ.ДопИнфоКоличествоНовыеСотрудники = НайденныеСтроки.Количество();
	
	Элементы.ГруппаJiraUsers.Видимость = НайденныеСтроки.Количество() > 0;
	Элементы.ГруппаJiraUsers.Доступность = НайденныеСтроки.Количество() > 0;
	
	//Ответ = Объ.ОбновитьТаблицаДжираПользователи();
	//Если Ответ.ОщибкаСоединения Тогда // შეცდომა სერვერთან დაკავშირებისას
	//	Сообщить("შეცდომა სერვერთან დაკავშირებისას, მიზეზი: " + Ответ.Текст);
	//	Возврат;
	//ИначеЕсли Ответ.ОщибкаКодСостояния Тогда // შეცდომა სერვერიდან დაბრუნებული კოდის პასუხის მიხედვით	
	//    Сообщить("შეცდომა სერვერიდან დაბრუნებული კოდის (" + Ответ.HTTPЗапрос.КодСостояния + ") პასუხის მიხედვით, მიზეზი: " + Ответ.Текст);
	//	Возврат;
	//КонецЕсли; 
		
	ЗначениеВРеквизитФормы(Объ, "Объект");	
	
КонецПроцедуры

#КонецОбласти

#Область Worklogs

&НаКлиенте
Процедура СинхронизацияСWorklogs(Команда)
	СинхронизацияСWorklogsНаСервере();
КонецПроцедуры

&НаСервере
Процедура СинхронизацияСWorklogsНаСервере()
	
	Объ = РеквизитФормыВЗначение("Объект");
	Если Не ЗначениеЗаполнено(Объ.ЗадНаРаботуМесацЗагрузки) Тогда
		Возврат;	
	КонецЕсли; 
	
	Ответ = Объ.ОбновитьТаблицуWorklogs();
	Если Ответ.ОщибкаСоединения Тогда // შეცდომა სერვერთან დაკავშირებისას
		Сообщить("შეცდომა სერვერთან დაკავშირებისას, მიზეზი: " + Ответ.Текст);
		Возврат;
	ИначеЕсли Ответ.ОщибкаКодСостояния Тогда // შეცდომა სერვერიდან დაბრუნებული კოდის პასუხის მიხედვით	
		Сообщить("შეცდომა სერვერიდან დაბრუნებული კოდის (" + Ответ.HTTPЗапрос.КодСостояния + ") პასუხის მიხედვით, მიზეზი: " + Ответ.Текст);
		Возврат;
	КонецЕсли; 
	
	Объ.ДопИнфоКоличествоНовыеСотрудники      = Ответ.ДопИнфо.КоличествоНовыеСотрудники;
	Объ.ДопИнфоКоличествоНовыеЗаданиеНаРаботу = Ответ.ДопИнфо.КоличествоНовыеЗаданиеНаРаботу;
	Объ.ДопИнфоWorklogsКолИзмененыеДлительностьВЧасах = Ответ.ДопИнфо.WorklogsКолИзмененыеДлительностьВЧасах;
	
	Элементы.ГруппаJiraUsers.Видимость = Ответ.ДопИнфо.КоличествоНовыеСотрудники > 0;
	Элементы.ГруппаJiraUsers.Доступность = Ответ.ДопИнфо.КоличествоНовыеСотрудники > 0;
	
	ЗначениеВРеквизитФормы(Объ, "Объект");
	
КонецПроцедуры

&НаКлиенте
Процедура СозданиеНовыхЗаданий(Команда)
	СозданиеНовыхЗаданийНаСервере();  
КонецПроцедуры

&НаСервере
Процедура СозданиеНовыхЗаданийНаСервере()
	
	ОбменДаннымиСервер.ПропуститьПроверкуЗапретаИзменения();
	Объ = РеквизитФормыВЗначение("Объект"); 
	Объ.ЗаданияНаРаботу();
	ЗначениеВРеквизитФормы(Объ, "Объект");
	ОбменДаннымиСервер.ПропуститьПроверкуЗапретаИзменения(Ложь);
	// ფორმაზე ცხრილის თავიდან განახლება
	СинхронизацияСWorklogsНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура WorklogsОбновлениеВремены(Команда)
	WorklogsОбновлениеВременыНаСервере();
КонецПроцедуры

&НаСервере
Процедура WorklogsОбновлениеВременыНаСервере()
	
	ОбменДаннымиСервер.ПропуститьПроверкуЗапретаИзменения();
	// არსებული დოკუმენტების განახლება
	Объ = РеквизитФормыВЗначение("Объект");
	Объ.WorklogsОбновлениеВременыНаСервере();
	ЗначениеВРеквизитФормы(Объ, "Объект");
	
	// წასაშლელია ლოკალურად შექმნილი დოკუმენტები
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаданиеНаРаботу.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ЗаданиеНаРаботу КАК ЗаданиеНаРаботу
		|ГДЕ
		|	ЗаданиеНаРаботу.Дата МЕЖДУ &Дата1 И &Дата2
		|	И ЗаданиеНаРаботу.Комментарий ПОДОБНО ""%Local%""";
	
	Запрос.УстановитьПараметр("Дата1", НачалоМесяца(Объ.ЗадНаРаботуМесацЗагрузки));
	Запрос.УстановитьПараметр("Дата2", КонецМесяца(Объ.ЗадНаРаботуМесацЗагрузки));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ДокОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		//ДокОбъект.ОбменДанными.ЗагрузкаДанных = Истина;
		ДокОбъект.Удалить();	
	КонецЦикла;
	
	// ყველა დოკუმენტს უნდა დაუბრუნდეს დეფაულტ ორგანიზაცია - ცხრილის განახლებულ ჩანაწერებში
	Н = 0;
	Для каждого ТекСтрока Из Объект.Worklogs Цикл
		Н = Н + 1;	
		Если ЗначениеЗаполнено(ТекСтрока.ЗаданиеНаРаботу) И ((Не ТекСтрока.ЗаданиеНаРаботу.Организация = Справочники.Организации.ОсновнаяОрганизация) Или (Не ТекСтрока.ЗаданиеНаРаботу.AzRyПроекты = ТекСтрока.Проект)) Тогда
			О = ТекСтрока.ЗаданиеНаРаботу.ПолучитьОбъект();
			О.Организация = Справочники.Организации.ОсновнаяОрганизация;
			О.AzRyПроекты = ТекСтрока.Проект;
			О.Записать(РежимЗаписиДокумента.Проведение); 
		КонецЕсли; 	
	КонецЦикла;
	
	// ყველა დოკუმენტს უნდა დაუბრუნდეს დეფაულტ ორგანიზაცია - თუ დარჩა კიდევ დოკუმენტები იმ თვეში
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаданиеНаРаботу.Ссылка КАК ЗаданиеНаРаботу
		|ИЗ
		|	Документ.ЗаданиеНаРаботу КАК ЗаданиеНаРаботу
		|ГДЕ
		|	ЗаданиеНаРаботу.Дата МЕЖДУ &Дата1 И &Дата2
		|	И ЗаданиеНаРаботу.Организация <> &Организация";
	
	Запрос.УстановитьПараметр("Дата1", НачалоМесяца(Объ.ЗадНаРаботуМесацЗагрузки));
	Запрос.УстановитьПараметр("Дата2", КонецМесяца(Объ.ЗадНаРаботуМесацЗагрузки));
	Запрос.УстановитьПараметр("Организация", Справочники.Организации.ОсновнаяОрганизация);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
	Н = 0;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Н = Н + 1;	
		
		О = ВыборкаДетальныеЗаписи.ЗаданиеНаРаботу.ПолучитьОбъект();
		О.Организация = Справочники.Организации.ОсновнаяОрганизация;
		О.Записать(РежимЗаписиДокумента.Проведение); 
	КонецЦикла;
		
	// ფორმაზე ცხრილის თავიდან განახლება
	СинхронизацияСWorklogsНаСервере();
	ОбменДаннымиСервер.ПропуститьПроверкуЗапретаИзменения(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура WorklogsGetMaxVertionByDate(Команда)
	WorklogsGetMaxVertionByDateНаСервере();
КонецПроцедуры

&НаСервере
Процедура WorklogsGetMaxVertionByDateНаСервере()
	Объ = РеквизитФормыВЗначение("Объект");
	//Ответ = Объ.GetMaxVertionByDate(Дата(2021,1,1)); // TODO თარიღის გადაცემის შესაძლებლობაა დასამატი
	Объ.WorklogResource = Объ.getMaxSelectVersion();
	//Сообщить(Ответ);
	ЗначениеВРеквизитФормы(Объ, "Объект");		
КонецПроцедуры

#КонецОбласти

#Область JiraProjects

&НаКлиенте
Процедура JiraProjectsСинхронизацияССервером(Команда)
	JiraProjectsСинхронизацияССерверомНаСервере();
КонецПроцедуры

&НаСервере
Процедура JiraProjectsСинхронизацияССерверомНаСервере()
	
	Объ = РеквизитФормыВЗначение("Объект");
	
	Ответ = Объ.GetJiraProjects();
	Если Ответ.ОщибкаСоединения Тогда // შეცდომა სერვერთან დაკავშირებისას
		Сообщить("შეცდომა სერვერთან დაკავშირებისას, მიზეზი: " + Ответ.Текст);
		Возврат;
	ИначеЕсли Ответ.ОщибкаКодСостояния Тогда // შეცდომა სერვერიდან დაბრუნებული კოდის პასუხის მიხედვით	
	    Сообщить("შეცდომა სერვერიდან დაბრუნებული კოდის (" + Ответ.HTTPЗапрос.КодСостояния + ") პასუხის მიხედვით, მიზეზი: " + Ответ.Текст);
		Возврат;
	КонецЕсли;
		
	Объ.ДопИнфоКоличествоНовыхJiraProjects = Ответ.ДопИнфо.КоличествоНовыеJiraProjects;
	
	Грп = ПодчиненныеЭлементы.ГруппаСтраницы.ПодчиненныеЭлементы.ГруппаJiraProjects.ПодчиненныеЭлементы.Группа1;
	Грп.ПодчиненныеЭлементы.JiraProjectsЗагрузитьНовые.Доступность = Ответ.ДопИнфо.КоличествоНовыеJiraProjects > 0;
	Грп.ПодчиненныеЭлементы.JiraProjectsОбновитьТекушие.Доступность = Ответ.ДопИнфо.КоличествоИзмененныйJiraProjects > 0;
		
	ЗначениеВРеквизитФормы(Объ, "Объект");	
	
КонецПроцедуры

&НаКлиенте
Процедура JiraProjectsЗагрузитьНовые(Команда)
	JiraProjectsЗагрузитьНовыеНаСервере();
КонецПроцедуры

&НаСервере
Процедура JiraProjectsЗагрузитьНовыеНаСервере()
	
	Объ = РеквизитФормыВЗначение("Объект");
	Объ.СозданиеНовыхJiraProjects();
	
	Ответ = Объ.GetJiraProjects();
	Если Ответ.ОщибкаСоединения Тогда // შეცდომა სერვერთან დაკავშირებისას
		Сообщить("შეცდომა სერვერთან დაკავშირებისას, მიზეზი: " + Ответ.Текст);
		Возврат;
	ИначеЕсли Ответ.ОщибкаКодСостояния Тогда // შეცდომა სერვერიდან დაბრუნებული კოდის პასუხის მიხედვით	
	    Сообщить("შეცდომა სერვერიდან დაბრუნებული კოდის (" + Ответ.HTTPЗапрос.КодСостояния + ") პასუხის მიხედვით, მიზეზი: " + Ответ.Текст);
		Возврат;
	КонецЕсли;
		
	Объ.ДопИнфоКоличествоНовыхJiraProjects = Ответ.ДопИнфо.КоличествоНовыеJiraProjects;
	
	Грп = ПодчиненныеЭлементы.ГруппаСтраницы.ПодчиненныеЭлементы.ГруппаJiraProjects.ПодчиненныеЭлементы.Группа1;
	Грп.ПодчиненныеЭлементы.JiraProjectsЗагрузитьНовые.Доступность = Ответ.ДопИнфо.КоличествоНовыеJiraProjects > 0;
	
	ЗначениеВРеквизитФормы(Объ, "Объект");
	
КонецПроцедуры

&НаКлиенте
Процедура JiraProjectsОбновитьТекушие(Команда)
	JiraProjectsОбновитьТекушиеНаСервере();
КонецПроцедуры

&НаСервере
Процедура JiraProjectsОбновитьТекушиеНаСервере()
	
	Объ = РеквизитФормыВЗначение("Объект");
	Объ.ОбновлениеJiraProjects();
	Объ.GetJiraProjects();
	ЗначениеВРеквизитФормы(Объ, "Объект");
	
КонецПроцедуры

#КонецОбласти

////////////////////////////////////////////////////////////////////////////////
// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ
